## Exercises I

In [26]:
import pandas as pd
import numpy as np
from env import get_db_url

In [29]:
url = get_db_url("employees")
sql = """
SELECT * FROM employees
"""
em = pd.read_sql(sql, url)
em.shape

(300024, 6)

In [3]:
# All exercises before nÂº 5 are just set up

### 5. Once you have successfully run a query:

a. Intentionally make a typo in the database url. What kind of error message do you see?

b. Intentionally make an error in your SQL query. What does the error message look like?

In [4]:
# depending on the error made the message of error changes. Example : NoSuchModuleError: Can't load plugin: sqlalchemy.dialects:mysql.pymsql

# It makes this error for the SQL querry: ProgrammingError: (pymysql.err.ProgrammingError) (1146, "Table 'employees.employs' doesn't exist")
#[SQL: SELECT * FROM employs LIMIT 5 OFFSET 50]
#(Background on this error at: https://sqlalche.me/e/14/f405)

### 6. Read the employees and titles tables into two separate DataFrames.
AND
### 7. How many rows and columns do you have in each DataFrame? Is that what you expected?

In [5]:
em.head()

   emp_no  birth_date first_name last_name gender   hire_date
0   10001  1953-09-02     Georgi   Facello      M  1986-06-26
1   10002  1964-06-02    Bezalel    Simmel      F  1985-11-21
2   10003  1959-12-03      Parto   Bamford      M  1986-08-28
3   10004  1954-05-01  Chirstian   Koblick      M  1986-12-01
4   10005  1955-01-21    Kyoichi  Maliniak      M  1989-09-12

In [6]:
em.shape

(300024, 6)

In [30]:
sql = """
SELECT * FROM titles
"""

titles = pd.read_sql(sql, url)
ttl = titles
ttl.head()

   emp_no            title   from_date     to_date
0   10001  Senior Engineer  1986-06-26  9999-01-01
1   10002            Staff  1996-08-03  9999-01-01
2   10003  Senior Engineer  1995-12-03  9999-01-01
3   10004         Engineer  1986-12-01  1995-12-01
4   10004  Senior Engineer  1995-12-01  9999-01-01

In [31]:
ttl.shape

(443308, 4)

### 8. Display the summary statistics for each DataFrame.

In [9]:
em.describe()

              emp_no
count  300024.000000
mean   253321.763392
std    161828.235540
min     10001.000000
25%     85006.750000
50%    249987.500000
75%    424993.250000
max    499999.000000

In [10]:
ttl.describe()

              emp_no
count  443308.000000
mean   253075.034430
std    161853.292613
min     10001.000000
25%     84855.750000
50%    249847.500000
75%    424891.250000
max    499999.000000

### 9. How many unique titles are in the titles DataFrame?

In [11]:
len(ttl.title.unique())

7

### 10. What is the oldest date in the to_date column?

In [12]:
ttl.to_date.min()

datetime.date(1985, 3, 1)

### 11. What is the most recent date in the to_date column?

In [13]:
ttl.to_date.max()

datetime.date(9999, 1, 1)

## Exercises II

#### 1. Copy the users and roles DataFrames from the examples above.

In [14]:
# Create the users DataFrame.

users = pd.DataFrame({
    'id': [1, 2, 3, 4, 5, 6],
    'name': ['bob', 'joe', 'sally', 'adam', 'jane', 'mike'],
    'role_id': [1, 2, 3, 3, np.nan, np.nan]
})
users

   id   name  role_id
0   1    bob      1.0
1   2    joe      2.0
2   3  sally      3.0
3   4   adam      3.0
4   5   jane      NaN
5   6   mike      NaN

In [15]:
# Create the roles DataFrame

roles = pd.DataFrame({
    'id': [1, 2, 3, 4],
    'name': ['admin', 'author', 'reviewer', 'commenter']
})
roles

   id       name
0   1      admin
1   2     author
2   3   reviewer
3   4  commenter

In [16]:
pd.concat([users, roles], axis=0)

   id       name  role_id
0   1        bob      1.0
1   2        joe      2.0
2   3      sally      3.0
3   4       adam      3.0
4   5       jane      NaN
5   6       mike      NaN
0   1      admin      NaN
1   2     author      NaN
2   3   reviewer      NaN
3   4  commenter      NaN

### 2. What is the result of using a right join on the DataFrames?

### 3. What is the result of using an outer join on the DataFrames?

### 4. What happens if you drop the foreign keys from the DataFrames and try to merge them?

## Exercises III

## 1. Use your get_db_url function to help you explore the data from the c database.

In [84]:
url = get_db_url('chipotle')
sql = """
SELECT * FROM orders
"""
oc = pd.read_sql(sql, url)
oc.shape

(4622, 6)

In [18]:
oc.columns

Index(['id', 'order_id', 'quantity', 'item_name', 'choice_description',
       'item_price'],
      dtype='object')

In [92]:
oc.describe(include='all')

,id,order_id,quantity,item,choice_description,price
count,4622.000000,4622.000000,4622.000000,4622,4622,4622
unique,NaN,NaN,NaN,50,1044,78
top,NaN,NaN,NaN,Chicken Bowl,nan,$8.75
freq,NaN,NaN,NaN,726,1246,730
mean,2311.500000,927.254868,1.075725,NaN,NaN,NaN
std,1334.400802,528.890796,0.410186,NaN,NaN,NaN
min,1.000000,1.000000,1.000000,NaN,NaN,NaN
25%,1156.250000,477.250000,1.000000,NaN,NaN,NaN
50%,2311.500000,926.000000,1.000000,NaN,NaN,NaN
75%,3466.750000,1393.000000,1.000000,NaN,NaN,NaN
max,4622.000000,1834.000000,15.000000,NaN,NaN,NaN

In [87]:
new_column = {'item_price': 'price', 'item_name': 'item'}

In [94]:
oc = oc.rename(columns = new_column)
oc.head()

,id,order_id,quantity,item,choice_description,price
0,1,1,1,Chips and Fresh Tomato Salsa,nan,$2.39
1,2,1,1,Izze,[Clementine],$3.39
2,3,1,1,Nantucket Nectar,[Apple],$3.39
3,4,1,1,Chips and Tomatillo-Green Chili Salsa,nan,$2.39
4,5,2,2,Chicken Bowl,"[Tomatillo-Red Chili Salsa (Hot), [Black Beans...",$16.98

In [89]:
oc.groupby('order_id').sum('price')

             id  quantity
order_id
1            10         4
2             5         2
3            13         2
4            17         2
5            21         2
...         ...       ...
1830       9223         2
1831      13842         3
1832       9233         2
1833       9237         2
1834      13863         3

[1834 rows x 2 columns]

In [90]:
oc.price

0        $2.39
1        $3.39
2        $3.39
3        $2.39
4       $16.98
         ...
4617    $11.75
4618    $11.75
4619    $11.25
4620     $8.75
4621     $8.75
Name: price, Length: 4622, dtype: object

In [99]:
oc['price'] = oc['price'].astype(float)
oc

,id,order_id,quantity,item,choice_description,price
0,1,1,1,Chips and Fresh Tomato Salsa,nan,2.39
1,2,1,1,Izze,[Clementine],3.39
2,3,1,1,Nantucket Nectar,[Apple],3.39
3,4,1,1,Chips and Tomatillo-Green Chili Salsa,nan,2.39
4,5,2,2,Chicken Bowl,"[Tomatillo-Red Chili Salsa (Hot), [Black Beans...",16.98
...,...,...,...,...,...,...
4617,4618,1833,1,Steak Burrito,"[Fresh Tomato Salsa, [Rice, Black Beans, Sour ...",11.75
4618,4619,1833,1,Steak Burrito,"[Fresh Tomato Salsa, [Rice, Sour Cream, Cheese...",11.75
4619,4620,1834,1,Chicken Salad Bowl,"[Fresh Tomato Salsa, [Fajita Vegetables, Pinto...",11.25
4620,4621,1834,1,Chicken Salad Bowl,"[Fresh Tomato Salsa, [Fajita Vegetables, Lettu...",8.75
4621,4622,1834,1,Chicken Salad Bowl,"[Fresh Tomato Salsa, [Fajita Vegetables, Pinto...",8.75

## 2. What is the total price for each order?

In [104]:
sum_price = oc.groupby(['order_id','price']).agg({'order_id': 'count', 'price': 'sum'})
sum_price.sample(10)

                order_id  price
order_id price
454      8.99          1   8.99
1365     2.95          1   2.95
163      1.50          1   1.50
1759     8.75          1   8.75
400      9.25          1   9.25
1414     8.75          2  17.50
1233     11.48         1  11.48
1627     2.95          1   2.95
663      8.49          1   8.49
1021     1.50          1   1.50

## 3. What are the most popular 3 items?

In [102]:
top_three = oc.groupby('item').quantity.sum().sort_values(ascending = False)

## 4. Which item has produced the most revenue?

## 5. Join the employees and titles DataFrames together.

In [81]:
em.merge(ttl, left_on='emp_no', right_on='emp_no', how='outer', indicator=True)
merged = em.merge(ttl, left_on='emp_no', right_on='emp_no', how='outer', indicator=True)
merged.sample()

,emp_no,birth_date,first_name,last_name,gender,hire_date,title,from_date,to_date,_merge
360645,444001,1957-08-22,Armond,Falco,M,1985-07-18,Staff,1997-12-10,9999-01-01,both

## 6. For each title, find the hire date of the employee that was hired most recently with that title.

In [83]:
merged[['emp_no', 'first_name', 'last_name', 'gender', 'hire_date', 'title']].hire_date.max()

datetime.date(2000, 1, 28)

In [66]:
merged.gr.hire_date.max()

AttributeError: 'Series' object has no attribute 'hire_date'

## 7. Write the code necessary to create a cross tabulation of the number of titles by department.